//
// Created by keer on 2019/12/27.
//
/**
 * 给你一个整数 n，请你帮忙计算并返回该整数「各位数字之积」与「各位数字之和」的差。
 *
 * 示例 1：
 * 输入：n = 234
 * 输出：15
 * 解释：
 * 各位数之积 = 2 * 3 * 4 = 24
 * 各位数之和 = 2 + 3 + 4 = 9
 * 结果 = 24 - 9 = 15
 *
 * 示例 2：
 * 输入：n = 4421
 * 输出：21
 * 解释：
 * 各位数之积 = 4 * 4 * 2 * 1 = 32
 * 各位数之和 = 4 + 4 + 2 + 1 = 11
 * 结果 = 32 - 11 = 21
 *
 * 提示：
 * 1 <= n <= 10^5

 * @param n
 * @return
 */
int subtractProductAndSum(int n){
    int a[6]={0,0,0,0,0,0};
    int mul=1,sum=0;
    a[0]=n/100000;
    a[1]=(n%100000)/10000;
    a[2]=((n%100000)%10000)/1000;
    a[3]=(((n%100000)%10000)%1000)/100;
    a[4]=((((n%100000)%10000)%1000)%100)/10;
    a[5]=n%10;
    for(int i=0,j=0;i<6;i++){
        sum=sum+a[i];
        if(a[i]==0&&j==0){

        }else{
            j=1;
            mul=mul*a[i];
        }
    }
    return mul-sum;
}